{
    "Company": "nvidia",
    "Articles": [
        {
            "title": "Nvidia says AI chip sales strong despite DeepSeek fears",
            "summary": " n Nvidia says ai chip sales strong despite deepseek fears. sales of the firm's chips hit more than more than $1billion last year. n Nvidia is the chip giant at the heart of the artificial intelligence ai boom. It said its business remained strong, despite fears of a bubble.",
            "sentiment": "positive"
        },
        {
            "title": "Nvidia shares sink as Chinese AI app spooks markets",
            "summary": " n Nvidia shares sink as chinese ai app spooks markets. us tech giant n Nvidia lost over a sixth of its value after the surging popularity of a chinese artificial intelligence app. deepseek, a ch Chinese ai chatbot reportedly made at a fraction of the cost of its r.",
            "sentiment": "negative"
        },
        {
            "title": "Nvidia unveils robot ambitions and powerful new gaming chips",
            "summary": "Nvidia CEO Jensen huang says the \"chatgpt moment for general robotics is just around the corner\" The firm has unveiled its nextgeneration of gaming chips. The announcements were part of a keynote address at CES in Las Vegas.",
            "sentiment": "positive"
        },
        {
            "title": "Nvidia targeted by China in new chip war probe",
            "summary": " n Nvidia targeted by china in new chip war probe. china has launched an investigation into us computer chipmaker n Nvidia, targeting one of america's leading tech companies. The probe marks the latest salvo in an ongoing uschina tech war over the lucrative s",
            "sentiment": "negative"
        },
        {
            "title": "Nvidia plunges almost 10% as global markets fall",
            "summary": " uk shares dropped on wednesday morning following falls in asian and us markets as concerns grow about the world's largest economy. data showed us manufacturing activity remains subdued, with investors now focussed now on us jobs figures due on friday. n Nvidia plunges almost 10 as global markets fall.",
            "sentiment": "negative"
        },
        {
            "title": "Nvidia is Wall Street’s most valuable company. How it got there, by the numbers",
            "summary": "Nvidia has once again turned out quarterly results that exceeded wall streets forecasts. The company has seen soaring demand for its semiconductors, which are used to power artificial intelligence applications. n Nvidia is wall streets most valuable company. how it got there, by the numbers.",
            "sentiment": "positive"
        },
        {
            "title": "Stock market today: Nvidia helps pull US indexes higher",
            "summary": "The sp 500 rose 0.4 after erasing an early drop of 0.7. The Nasdaq composite composite rose 1.2%. The S&P 500 and the Dow Jones Industrial Average both rose by 0.3%. The NASDAQ composite rose by 1.1%.",
            "sentiment": "positive"
        },
        {
            "title": "Why Nvidia’s earnings are important to the entire U.S. stock market",
            "summary": "Nvidias will release its latest financial results wednesday. Analysts are eyeing future demand amid a chinese upstarts claim that nvidias chip is better than any other in the world. Nvidias is based in Los Angeles, California, but also has offices in New York and London.",
            "sentiment": "negative"
        },
        {
            "title": "Nvidia posted another strong quarterly report. What to know, by the numbers",
            "summary": " n Nvidia posted another strong quarterly report. what to know, by the numbers wall street once again fixated on an earnings report from n Nvidia, the main player in the artificial intelligence mania. the chipmaker reported earnings after the bell wednesday that topped analyst forecasts.",
            "sentiment": "negative"
        },
        {
            "title": "Nvidia faces a reckoning as Chinese upstart raises questions about Wall Street’s darling",
            "summary": "Nvidia's tumble caused 595 billion in wealth to vanish. That's about as much as pepsico, mcdonalds, and McDonalds. nvidias stock has been on an astonishing run over the last few years. It is now facing a reckoning as chinese upstart.",
            "sentiment": "positive"
        }
    ],
    "Coverage differences": " n Nvidia says ai chip sales strong despite deepseek fears. sales of the firm's chips hit more than more than 1billion last year. n n Nvidia lost over a sixth of its value after the surging popularity of a chinese artificial intelligence app. deepseek, a ch chinese ai chatbot reportedly made at a fraction of the cost of its r. negative n Nvidia unveils robot ambitions and powerful new gaming chips. the announcements were part of a keynote address at ces in las vegas."
}