{
    "BBC": [
        {
            "title": "Exhibition of apples grown from discarded cores",
            "content": "An orchard of trees that started life as discarded apple cores in hedgerows and waysides, is the subject of a new exhibition in Cornwall.\nThe Some Interesting Apples project has found more than 600 apple wildings in the county since 2019, according to The University of Exeter which supported the scheme.\nThe university said working with the National Trust, the project created the first ever orchard in the UK dedicated to growing apples seeded by chance in the wild in 2023.\nCo-founder William Arnold has documented the first six months of the orchard's growth and his photography will be on display at the university's Penryn Campus in April.\nThe exhibition will show the variety of apples found across the county.\nThe university said 80 apple rootstocks were planted at The Wilding Mother Orchard site near Helford in 2024, with the grafting of the wilding scions beginning later in the year.\nThe orchard, which is used as a community and research resource, is jointly managed by The National Trust Lizard and Penrose team, and Some Interesting Apples.\nThe photography shows the grafted plants after six months.\nMr Arnold said: \"People get alarmed when they realise that the heritage apple varieties they love might not survive in a climate-changed world.\n\"They don't appreciate that we are surrounded by unique wild apple volunteers that may be better adapted to future conditions.\"\nFollow BBC Cornwall on X, external, Facebook, external and Instagram, external. Send your story ideas to spotlight@bbc.co.uk, external.",
            "source": "bbc_news"
        },
        {
            "title": "Apple encrypted data row hearing begins in secret",
            "content": "Apple's encrypted data case against the UK government has begun in secret at the Royal Courts of Justice.\nThe Home Office has demanded the right to access data from Apple users that have turned on Advanced Data Protection (ADP), a tool that prevents anyone other than the user - including the tech giant - from reading their files.\nApple says it is important for privacy - but the UK government says it needs to be able to access data if there is a national security risk.\nThe BBC - along with civil liberties groups and some US politicians - argue the case should be heard in public.\nBut Friday's session of the Investigatory Powers Tribunal - which is hearing the matter - was held behind closed doors.\nIt is not clear whether later phases of the case will be opened to the public - the BBC has submitted a written argument that it should be.\nAs well as the BBC, journalists from the Guardian, the Telegraph, PA, Bloomberg, and Computer Weekly attended the Royal Courts of Justice but were not admitted into the court room.\nSir James Eadie KC, who previously represented the government in significant cases such as Shamima Begum's citizenship appeal, was seen entering the hearing.\nOn Thursday, five US politicians from across the political divide urged the court to remove what they call the \"cloak of secrecy\" surrounding the row - which they say has major security implications.\nA group of civil liberties groups made a similar plea, saying barring the media would be an \"affront to the global privacy and security issues that are being discussed.\"\nThe case is about balancing national security against privacy rights.\nADP is end to end encrypted, meaning no-one can access files that have been secured with it apart from their owner.\nOther end to end encrypted services in the UK include Signal, Meta's WhatsApp, and Apple's iMessage.\nIn February, it emerged the UK government was seeking the right to be able to access data protected in this way using powers granted to it under the Investigatory Powers Act.\nThe Act allows it to compel firms to provide information to law enforcement agencies.\nApple responded by pulling ADP in the UK and then launching legal action to challenge the government's demand.\nApple says agreeing to what the UK is asking for it would require the creation of a so-called backdoor, a capability critics say would eventually be exploited by hackers.\n\"As we have said many times before, we have never built a backdoor or master key to any of our products or services and we never will,\" Apple says on its website, external.\nThe Home Office has previously told the BBC: \"The UK has a longstanding position of protecting our citizens from the very worst crimes, such as child sex abuse and terrorism, at the same time as protecting people's privacy.\n\"The UK has robust safeguards and independent oversight to protect privacy and privacy is only impacted on an exceptional basis, in relation to the most serious crimes and only when it is necessary and proportionate to do so.\"",
            "source": "bbc_news"
        },
        {
            "title": "Pressure grows to hold secret Apple data privacy hearing in public",
            "content": "US politicians, civil rights campaigners and the BBC are all calling for a High Court hearing about a data privacy row between Apple and the UK government to be held in public.\nThe tech giant is taking legal action after the Home Office demanded the right to access customer data protected by its Advanced Data Protection (ADP) programme.\nApple cannot access data stored in this way currently - but the UK government says it needs to be able to see it if there is a national security risk.\nThe BBC understands the matter will be considered at a closed hearing of the Investigatory Powers Tribunal at the High Court on Friday morning.\nIn an open letter, five US politicians from across the political divide have urged the Tribunal to remove what they call the \"cloak of secrecy\" surrounding the row - which they say has major security implications.\nThe letter has been signed by Senators Ron Wyden and Alex Padilla, and Members of Congress Warren Davidson, Andy Biggs and Zoe Lofgren.\n\"It is imperative that the UK's technical demands of Apple - and of any other US companies - be subjected to robust, public analysis and debate,\" they said.\nThe BBC has contacted Apple for a response. The Home Office declined to comment.\nSeparately, a group of civil liberties organisations has also written to the Tribunal president, Lord Justice Singh.\nBig Brother Watch, Index on Censorship, and Open Rights Group argue there is \"significant public interest\" in \"on what basis the UK government believes it can compel a private company to undermine the privacy and security of its customers\".\n\"Holding this Tribunal in secret would be an affront to the global privacy and security issues that are being discussed,\" Open Rights Group Executive Director Jim Killock told the BBC.\n\"This is bigger than just the UK or Apple.\"\nThe BBC is also asking the Tribunal for the hearing to be in public so it can report what is said by the parties present.\nADP is contentious because it is end to end encrypted, meaning no-one can access files that have been secured with it apart from their owner.\nIn February, it emerged the UK government was seeking the right to be able to access data protected in this way using powers granted to it under the Investigatory Powers Act.\nThe Act allows it to covertly compel firms to provide information to law enforcement agencies.\nApple responded by pulling ADP in the UK and then launching legal action to challenge the government's demand.\nIt is understood the matter will come before Lord Justice Singh on Friday.\nBecause it relates to the security services, it is scheduled to be held in private.\nIn an earlier statement, Apple said: \"Enhancing the security of cloud storage with end to end encryption is more urgent than ever before.\n\"Apple remains committed to offering our users the highest level of security for their personal data and are hopeful that we will be able to do so in future in the UK.\"\nThe Home Office has previously told the BBC: \"The UK has a longstanding position of protecting our citizens from the very worst crimes, such as child sex abuse and terrorism, at the same time as protecting people's privacy.\n\"The UK has robust safeguards and independent oversight to protect privacy and privacy is only impacted on an exceptional basis, in relation to the most serious crimes and only when it is necessary and proportionate to do so.\"",
            "source": "bbc_news"
        },
        {
            "title": "Secret hearing on Friday in Apple and UK government data row",
            "content": "Apple's appeal against a UK government demand to be able to access its customers' most highly encrypted data is set to be considered at a secret hearing at the High Court on Friday, the BBC understands.\nIt is due to be considered by the Investigatory Powers Tribunal - an independent court which has the power to investigate claims against the UK intelligence services.\nThe US tech giant took legal action earlier this month in response to the Home Office's demand for the right to access customer information protected by Apple's Advanced Data Protection (ADP) programme.\nCurrently Apple cannot access data stored in this way and therefore is unable to share it with law enforcement if issued with a warrant.\nThe government says it needs to be able to see it if there is a national security risk.\nThe US tech giant took legal action earlier this month in response to the Home Office's demand for the right to access customer information protected by Apple's Advanced Data Protection (ADP) programme.\nApple declined to comment. The Home Office and the Tribunal have been approached by the BBC.\nThe hearing is due to be held in private because it relates to the security services, but campaigners say the public has a right to hear it.\n\"This hearing should not be held in secret,\" Caroline Wilson Palow, legal director at Privacy International told the BBC.\n\"The public has a right to know whether or not the security of a service that could be used by millions or perhaps billions of people worldwide is being undermined.\"\nThe row began in February when it first emerged the government was seeking the right to be able to access data protected by ADP, using powers granted to it under the Investigatory Powers Act.\nThe Act allows it to covertly compel firms to provide information to law enforcement agencies.\nADP allows users with iCloud accounts and storage to secure photos, notes, voice memos and other data with end to end encryption, meaning no-one but the user - not even Apple - can access it.\nGetting round that would involve the creation of a so-called \"backdoor\" - a capability some fear bad actors would ultimately be able to exploit.\nAt the time Apple reiterated its long-standing commitment not to weaken the privacy or security of its systems.\n\"As we have said many times before, we have never built a backdoor or master key to any of our products, and we never will,\" a spokesperson told the BBC.\nLater in February the row escalated, as Apple announced it was pulling ADP in the UK.\nShortly after that, the BBC learnt Apple was taking legal action by appealing to the Investigatory Powers Tribunal to try to overturn the government's demand.\nOn its website, the Tribunal lists a hearing to be held before its president Lord Justice Singh on Friday afternoon.\nThe listing makes no mention of Apple or the government, nor has the Tribunal confirmed if they are the parties involved - however a source familiar with the matter has indicated that is the case, as was first reported by Computer Weekly, external.\nIn the statement it issued in February, Apple said it regretted the action it felt it had been forced to take.\n\"Enhancing the security of cloud storage with end-to-end-encryption is more urgent than ever before,\" it said.\n\"Apple remains committed to offering our users the highest level of security for their personal data and are hopeful that we will be able to do so in future in the UK.\"\nIn a previous statement, a Home Office spokesperson said: \"The UK has a longstanding position of protecting our citizens from the very worst crimes, such as child sex abuse and terrorism, at the same time as protecting people's privacy.\n\"The UK has robust safeguards and independent oversight to protect privacy and privacy is only impacted on an exceptional basis, in relation to the most serious crimes and only when it is necessary and proportionate to do so.\"",
            "source": "bbc_news"
        },
        {
            "title": "Grandmother gets X-rated message after Apple AI fail",
            "content": "A woman from Dunfermline has spoken of her shock after an Apple voice-to-text service mistakenly inserted a reference to sex - and an apparent insult - into a message left by a garage.\nLouise Littlejohn, 66, received a voicemail message on Wednesday from a Lookers Land Rover garage in Motherwell inviting her to an event.\nAn artificial intelligence (AI) powered service offered by Apple turned it into a text message which - to her surprise - asked if she been \"able to have sex\" before calling her a \"piece of ****\".\nMrs Littlejohn told BBC News: \"Initially I was shocked - astonished - but then I thought that is so funny. The text was obviously quite inappropriate.\n\"The garage is trying to sell cars, and instead of that they are leaving insulting messages without even being aware of it. It is not their fault at all.\"\nApple and the garage both declined to comment.\nAn expert has told the BBC the AI system may have struggled in part because of the caller's Scottish accent, but far more likely factors were the background noise at the garage and the fact he was reading off a script.\nMrs Littlejohn said she initially thought the call was a scam, but then recognised that the associated number was from the Motherwell area.\nShe had bought a car from the same garage a few years ago.\nThe BBC has listened to the audio left by the garage worker and confirmed it was a conventional business call.\nThe transcription is so jumbled it's hard to decipher where it went wrong, but the reference to \"sex\" may have in fact been when the caller mentioned the \"sixth\" of March.\nThe BBC has removed the name of the garage employee:\n\"Hi Mrs Littlejohn, it is ____ here from Lookers Land Rover in Lanarkshire. I hope you are well. Just a wee call to see if you have received your invite to our new car INAUDIBLE event that we do have on between the sixth and tenth of March.\n\"Just a wee call to see if it is something you were looking to come along to, and to see if we can confirm an appointment slot that would be suitable for yourself. If it is something you would be interested in, feel free to give me a call on ____, ask for myself ____ INAUDIBLE. Thank you.\"\nOn Apple's website, it details how their voicemail transcription, external is limited to voicemails in English received on an iPhone with iOS 10 operating system or later, and the transcription \"depends on the quality of the recording\".\nPeter Bell, a professor of speech technology at the University of Edinburgh, listened to the message left for Mrs Littlejohn.\nHe suggested it was at the \"challenging end for speech-to-text engines to deal with\".\nHe believes there are a number of factors which could have resulted in rogue transcription:\nThe fact it is over the telephone and, therefore, harder to hear\nThere is some background noise in the call\nThe way the garage worker speaks is like he is reading a prepared script rather than speaking in a natural way\n\"All of those factors contribute to the system doing badly, \" he added. \"The bigger question is why it outputs that kind of content.\n\"If you are producing a speech-to-text system that is being used by the public, you would think you would have safeguards for that kind of thing.\"\nMany people in Scotland will remember a sketch from the BBC comedy show Burnistoun, when two Scottish men get trapped after the voice-activated lift can't understand their accents.\nIt has hundreds of millions of views online, and tapped into a feeling some Scots have about voice technology.\nIn 2016, Scots were asked to work with voice recognition technology in a bid to help mobile phones decipher the accent better.\nFor Prof Bell, the Scottish accent may have had an impact here along with all other factors, but - with ideal audio conditions - problems that technology will have with the Scottish accent are \"a thing of the past\".\nHowever, this not the first time that Apple's speech tools have recently hit the headlines for the wrong reasons.\nA few weeks ago, the tech giant said it was working to fix its speech-to-text tool after some social media users found that when they spoke the word \"racist\" into their iPhones it typed it out as \"Trump\".\nApple also suspended its AI summaries of news headlines after it displayed false notifications on stories.",
            "source": "bbc_news"
        }
    ],
    "AP": [
        {
            "title": "A key to protecting apples from climate change might be hiding in Michigan’s forests",
            "content": "In the quest to make apple trees more resilient in a warming climate, some Michigan researchers are looking for a late bloomer.\nA native Michigan apple tree, the Malus coronaria, learned to fight frost by blooming two or three weeks later than the trees that produce cultivated varieties of apples like Honeycrisp or Red Delicious.\n“That doesn’t sound like a lot, but almost always that’s enough for the flowers to escape the killing spring frost,” said Steve van Nocker, a Michigan State University professor and plant geneticist.\nVan Nocker wants to identify the genes responsible for the Malus coronaria’s delayed blooms and use them to develop more frost-resistant apple varieties, a decades-long process. But first, he’s hiking through forests, trying to find the elusive trees.\nVan Nocker’s project is one of many ways researchers and growers are trying to make apples more resilient as climate change makes weather less predictable.\nIn Europe and South Korea, growers are experimenting with solar panels in vineyards and orchards. The panels protect fruit from hail and sun damage but also let in light and heat when necessary, said Jared Buono, the director of Cornell University’s Hudson Valley Research Lab. Buono’s lab is also adding solar panels to its experimental orchard.\nUniversity of Maryland researchers recently announced the development of a more heat-tolerant apple variety. At Penn State University, a team built an unmanned vehicle with a propane-fueled heater that can roll through an orchard and automatically warm trees.\n\nBuono said such efforts can mitigate the impact of unusual weather like a May 18, 2023 frost that damaged trees across New York state and cut apple production by 20%.\n“Growers’ jobs are already hard,” Buono said. “The change in climate, the increased unpredictability and variability, makes it that much harder.”\nAccording to a Washington State University study published this month, major apple-growing counties in the top three U.S. apple-producing states -- Washington, Michigan and New York -- are seeing fewer cold days and more warm fall nights than they used to. Washington also is experiencing more extreme heat.\nThe study, which examined climate data from 1979 to 2022, said the temperature trends could alter bloom timing, bring trees out of dormancy too early and increase the risk of sunburn, which hurts the appearance and quality of apples.\nThat’s why, on a chilly day in December, van Nocker and graduate assistant Lily “Kaz” Christian hiked through a public park near Michigan State to check on a handful of Malus coronaria trees they had found there.\nMalus coronaria – also called sweet crabapple -- was once so common in Michigan its blossoms were designated as the state flower in 1897. But the species appears to be in decline, van Nocker said. Parking lots and shopping centers now stand in many of the places where the tree was documented in the past, and the remaining trees often produce little new growth or fruit.\nWhen they reached the trees, van Nocker and Christian cut off small pieces of the stems. The snippets will be tested to ensure they are fully Malus coronaria and not a hybrid. Then, these Malus coronaria cuttings — along with cuttings from previous hunts — will be grafted onto an apple rootstock. That will allow them to grow into trees which are identical to the original.\nHowever, the goal is not to replace popular varieties like Fuji or Honeycrisp with Malus coronaria apples, since the Michigan tree’s fruit is small, green and bitter.\n“To me, they don’t taste good at all,” van Nocker said.\nInstead, he wants to identify the genes that cause late blooming and create a genetic stock that breeders could use to develop commercial apples. Van Nocker also is sending seeds to the U.S. Department of Agriculture so the genetic stock won’t be lost if the tree continues to decline.\nMaking a later-blooming commercial apple could take decades. If a Malus coronaria is crossed with a commercial apple tree to make a new hybrid, it would take four or five years for that tree to start producing apples. Crossbreeding would continue until researchers developed an apple with the desired traits of both varieties.\nBut van Nocker said it’s critical to try.\n“With climate change, it’s quite possible that apples won’t be able to be produced in Michigan in the future,” he said. “That’s why cultivar improvement, especially in terms of frost resistance, is so important.”",
            "source": "ap_news"
        },
        {
            "title": "Apple announces $500 billion investment in US amid tariff threats that could affect the iPhone",
            "content": "NEW YORK (AP) — Apple announced Monday that it plans to invest more than $500 billion in the United States over the next four years, including plans to hire 20,000 people and build a new server factory in Texas.\nThe move comes just days after President Donald Trump said Apple CEO Tim Cook promised him that the tech giant’s manufacturing would shift from Mexico to the U.S. Trump noted the company was doing so to avoid paying tariffs. That pledge, coupled with Monday’s investment commitment, came as Trump continues to threaten to impose tariffs that could drive up the cost of iPhones made in China.\n“We are bullish on the future of American innovation, and we’re proud to build on our long-standing U.S. investments with this $500 billion commitment to our country’s future,” Cook said in a company blog post.\nApple outlined several concrete moves in its announcement, the most significant of which is the construction of a new factory in Houston — slated to open in 2026 — that will produce servers to power Apple Intelligence, its suite of AI features. The company claims this factory will create “thousands of jobs.”\nThe announcement is similar to one Apple made in early 2018 — during the first Trump administration — that promised to create 20,000 new jobs as part of a $350 billion spend in the U.S. Trump was also mulling a tariff then that could have affected iPhones at the time, but he didn’t end up targeting those devices during his first administration.",
            "source": "ap_news"
        },
        {
            "title": "Apple will fix iPhone glitch that suggests replacing the word ‘racist’ with ‘Trump’",
            "content": "LONDON (AP) — Apple is fixing a bug within the dictation feature on some iPhones that briefly suggests the word “Trump” when a word with an R consonant is spoken, including “racist.”\nThe company is responding to the controversy after some iPhone owners posted videos on social media this week to detail how the glitch works.\nWhen users activated the dictation feature and said the word “racist,” the word “Trump” appears in the text window before quickly being replaced by the correct word, according to various videos posted online.\n“We are aware of an issue with the speech recognition model that powers Dictation and we are rolling out a fix today,” Apple said in a statement sent to The Associated Press on Wednesday.\nThe company said that the speech recognition models that power the voice-to-text feature might show words with some phonetic overlap.\nIt also said that other words that have an “r” consonant were also erroneously triggering the bug. The Associated Press could not duplicate the problem on Wednesday, a day after it emerged.\nThis week the company announced a plan to invest more than $500 billion and hire 20,000 people in the United States over the next four years as well as build a new factory in Texas, amid Trump’s threats to impose tariffs on imports. Separately, Apple shareholders rebuffed an attempt to pressure the company into joining Trump’s push to scrub corporate programs designed to diversify its workforce.",
            "source": "ap_news"
        },
        {
            "title": "Apple shareholders reject proposal to scrap company’s diversity programs",
            "content": "Apple shareholders rebuffed an attempt to pressure the technology trendsetter into joining President Donald Trump’s push to scrub corporate programs designed to diversify its workforce.\nThe proposal drafted by the National Center for Public Policy Research — a self-described conservative think tank — urged Apple to follow a litany of high-profile companies that have retreated from diversity, equity and inclusion initiatives currently in the Trump administration’s crosshairs.\nAfter a brief presentation about the anti-DEI proposal, Apple announced shareholders had rejected it. In a regulatory filing submitted Tuesday evening, Apple disclosed that 97% of the outstanding shares that cast ballots voted against the measure.\nThe outcome vindicated Apple management’s decision to stand behind its diversity commitment even though Trump asked the U.S. Department of Justice to look into whether these types of programs have discriminated against some employees whose race or gender aren’t aligned with the initiative’s goals.\nBut Apple CEO Tim Cook has maintained a cordial relationship with Trump since his first term in office, an alliance that so far has helped the company skirt tariffs on its iPhones made in China. After Cook and Trump met last week, Apple on Monday announced it will invest $500 billion in the U.S. and create 20,000 more jobs during the next five years — a commitment applauded by the president.\nTuesday’s shareholder vote came a month after the same group presented a similar proposal during Costco’s annual meeting, only to have it overwhelmingly rejected, too.\n\nThat snub didn’t discourage the National Center for Public Policy Research from confronting Apple about its DEI program in a pre-recorded presentation by Stefan Padfield, executive director of the think tank’s Free Enterprise Project, who asserted “forced diversity is bad for business.”\nIn the presentation, Padfield attacked Apple’s diversity commitments for being out of line with recent court rulings and said the programs expose the Cupertino, California, company to an onslaught of potential lawsuits for alleged discrimination. He cited the Trump administration as one of Apple’s potential legal adversaries.\nApple shareholders rejected an attempt to pressure the company into joining President Donald Trump’s push to scrap corporate programs designed to diversify its workforce.\n“The vibe shift is clear: DEI is out and merit is in,” Padfield said in the presentation.\nThe specter of potential legal trouble was magnified last week when Florida Attorney General James Uthmeier filed a federal lawsuit against Target alleging the retailer’s recently scaled-back DEI program alienated many consumers and undercut sales to the detriment of shareholders.\nJust as Costco does, Apple contends that fostering a diverse workforce makes good business sense.\nBut Cook conceded Apple may have to make some adjustments to its diversity program “as the legal landscape changes” while still striving to maintain a culture that has helped elevate the company to its current market value of $3.7 trillion — greater than any other business in the world.\n“We will continue to create a culture of belonging,” Cook told shareholders during the meeting.\nIn its last diversity and inclusion report issued in 2022, Apple disclosed that nearly three-fourths of its global workforce consisted of white and Asian employees. Nearly two-thirds of its employees were men.\nOther major technology companies for years have reported employing mostly white and Asian men, especially in high-paid engineering jobs — a tendency that spurred the industry to pursue largely unsuccessful efforts to diversify.",
            "source": "ap_news"
        }
    ]
}