{
    "BBC": [
        {
            "title": "Nvidia says AI chip sales strong despite DeepSeek fears",
            "content": "Nvidia, the chip giant at the heart of the artificial intelligence (AI) boom, said its business remained strong, despite fears of a bubble stirred by the emergence of Chinese AI firm DeepSeek last month.\nSales of the firm's chips hit more than $39bn (Â£30.7bn) over the three months ended 27 January, up 74% year-on-year.\nNvidia has seen a surge of demand, as big tech companies turn to the firm for chips that can handle the large amounts of data used to train AI models.\nBut DeepSeek said it had trained its chatbot using less advanced, and less expensive chips.\nIts launch prompted a sharp sell-off in Nvidia shares earlier this month, a hit felt throughout the market.\nInvestors calmed after big companies such as Facebook owner Meta said they expected to continue their current AI investment strategies.\nNvidia boss Jensen Huang said he was not worried that demand would suddenly shift, saying that software in the future would be created by machine learning that needs chips with different architecture than the \"hand-coding\" of the past.\n\"We know fundamentally software has changed,\" he said, adding that it was also still \"early days\" for the use of AI to spread.\nNvidia currently dominates the market in advanced chips, making it central to the boom in AI investment at companies such as Microsoft.\nIts shares have surged more than 400% over the last two years, giving the company a market value of more than $3tn.\nNvidia said it was focused on rapidly building out production of its latest chips, known as Blackwell, which helped to drive a surge in the firm's revenue.\nThe company's finance chief Collette Kress said its AI data centre business was strongest in the US, but the firm was also seeing demand grow in other parts of the world, pointing to investments by France and the European Union.\nShe said demand in China - where US trade controls have blocked the firm from exporting certain chips - remained lower and that the firm expected shipments to remain roughly at the current level.",
            "source": "bbc_news"
        },
        {
            "title": "Nvidia shares sink as Chinese AI app spooks markets",
            "content": "US tech giant Nvidia lost over a sixth of its value after the surging popularity of a Chinese artificial intelligence (AI) app spooked investors in the US and Europe.\nDeepSeek, a Chinese AI chatbot reportedly made at a fraction of the cost of its rivals, launched last week but has already become the most downloaded free app in the US.\nAI chip giant Nvidia and other tech firms connected to AI, including Microsoft and Google, saw their values tumble on Monday in the wake of DeepSeek's sudden rise.\nIn a separate development, DeepSeek said on Monday it will temporarily limit registrations because of \"large-scale malicious attacks\" on its software.\n\nThe DeepSeek chatbot was reportedly developed for a fraction of the cost of its rivals, raising questions about the future of America's AI dominance and the scale of investments US firms are planning.\nLast week, OpenAI joined a group of other firms who pledged to invest $500bn (Â£400bn) in building AI infrastructure in the US.\nPresident Donald Trump, in one of his first announcements since returning to office, called it \"the largest AI infrastructure project by far in history\" that would help keep \"the future of technology\" in the US.\nDeepSeek is powered by the open source DeepSeek-V3 model, which its researchers claim was trained for around $6m  - significantly less than the billions spent by rivals.\nBut this claim has been disputed by others in AI.\nThe researchers say they use already existing technology, as well as open source code - software that can be used, modified or distributed by anybody free of charge.\nDeepSeek's emergence comes as the US is restricting the sale of the advanced chip technology that powers AI to China.\nTo continue their work without steady supplies of imported advanced chips, Chinese AI developers have shared their work with each other and experimented with new approaches to the technology.\nThis has resulted in AI models that require far less computing power than before.\nIt also means that they cost a lot less than previously thought possible, which has the potential to upend the industry.\nAfter DeepSeek-R1 was launched earlier this month, the company boasted of \"performance on par with\" one of OpenAI's latest models when used for tasks such as maths, coding and natural language reasoning.\nSilicon Valley venture capitalist and Trump adviser Marc Andreessen described DeepSeek-R1 as \"AI's Sputnik moment\", a reference to the satellite launched by the Soviet Union in 1957.\nAt the time, the US was considered to have been caught off-guard by their rival's technological achievement.\nDeepSeek's sudden popularity has startled stock markets in Europe and the US.\nIn the US, AI chipmaker Nvidia ended Monday's trading having plunged 16.9% while its rival Broadcom slumped 17.4%.\nOther tech firms also sank, with Microsoft down 2.14% and Google's owner Alphabet down over 4%.\nIn Europe, Dutch chip equipment maker ASML ended Monday's trading with its share price down by more than 7% while shares in Siemens Energy, which makes hardware related to AI, had plunged by a fifth.\n\"This idea of a low-cost Chinese version hasn't necessarily been forefront, so it's taken the market a little bit by surprise,\" said Fiona Cincotta, senior market analyst at City Index.\n\"So, if you suddenly get this low-cost AI model, then that's going to raise concerns over the profits of rivals, particularly given the amount that they've already invested in more expensive AI infrastructure.\"\nSingapore-based technology equity adviser Vey-Sern Ling told the BBC it could \"potentially derail the investment case for the entire AI supply chain\".\nBut Wall Street banking giant Citi cautioned that while DeepSeek could challenge the dominant positions of American companies such as OpenAI, issues faced by Chinese firms could hamper their development.\n\"We estimate that in an inevitably more restrictive environment, US access to more advanced chips is an advantage,\" analysts said in a report.\nMeanwhile, DeepSeek said on Monday it had been the victim of a cyberattack.\n\"Due to large-scale malicious attacks on DeepSeek's services, we are temporarily limiting registrations to ensure continued service,\" it said in a statement.\n\"Existing users can log in as usual. Thanks for your understanding and support.\"\nThe company was founded in 2023 by Liang Wenfeng in Hangzhou, a city in southeastern China.\nThe 40-year-old, an information and electronic engineering graduate, also founded the hedge fund that backed DeepSeek.\nHe reportedly, external built up a store of Nvidia A100 chips, now banned from export to China.\nExperts believe this collection - which some estimates put at 50,000 - led him to launch DeepSeek, by pairing these chips with cheaper, lower-end ones that are still available to import.\nMr Liang was recently seen at a meeting between industry experts and the Chinese premier Li Qiang.\nIn a July 2024 interview with The China Academy, external, Mr Liang said he was surprised by the reaction to the previous version of his AI model.\n\"We didn't expect pricing to be such a sensitive issue,\" he said.\n\"We were simply following our own pace, calculating costs, and setting prices accordingly.\"\nAdditional reporting by Joao Da Silva and Dearbail Jordan.\nSign up for our Tech Decoded newsletter to follow the biggest developments in global technology, with analysis from BBC correspondents around the world. Outside the UK? Sign up here.",
            "source": "bbc_news"
        },
        {
            "title": "Nvidia unveils robot ambitions and powerful new gaming chips",
            "content": "The boss of US  chip giant Nvidia has unveiled the firm's next-generation of gaming chips and pledged the \"ChatGPT moment for general robotics is just around the corner\".\nThe announcements were part of CEO Jensen Huang's keynote address at CES, the major annual technology show in Las Vegas.\nThe new family of gaming chips will use Nvidia's Blackwell artificial intelligence (AI) technology to create movie-quality images, he told a packed arena.\nThe chips will range in price from $549 (Â£438) to $1,999, and are twice as fast as their predecessors, he added.\nHe also introduced an AI model, called Cosmos, which he said could generate video that can be used to train robots and self-driving cars at a much lower cost than current methods.\nBy creating what is known in the industry as \"synthetic\" training data, the model can help robots and cars better understand the physical world.\nUsers will be able to give Cosmos a text description that can be used to generate video of a world that obeys the laws of physics.\n\"All of the enabling technologies that I've been talking about is going to make it possible for us in the next several years to see very rapid breakthroughs, surprising breakthroughs in general robotics,\" he predicted, though he added much more training data would be needed.\nMr Huang carried out a real-time demonstration of the new gaming chip that showed off highly detailed graphics featuring an array of textures and manoeuvres.\n\"It was awesome that they can do this in real time,\" said Gary Yang, a graduate student in robotics at the California Institute of Technology.\n\"Previously we'd think of these graphics as pre-rendered.\"\nThe new chips will start making their way to consumers starting in late January.\n\"I thought it was incredible,\" said Scott Epstein of technology start-up Agenovate AI.\n\"They are continuing to innovate.\"\nMr Yang and Mr Epstein were among thousands of people who watched the speech both in person and virtually on the eve of the official opening of CES.\nThe convention is expected to draw more than 150,000 attendees and over 4,500 exhibitors over the next week.\nNvidia's shares touched a new record high on Monday in the run-up to Mr Huang's highly anticipated address.\nHe spent the first part of his speech talking about the company's history.\nFounded in 1993, Nvidia was originally known for making the type of computer chips that process graphics, particularly for computer games.\nThirty-one years later, Nvidia now stands at the forefront of the development of chips that power AI, with a market value of more than $3tn.\nHowever, Nvidia still faces some significant challenges, including from regulators around the world who have raised concerns about its growing dominance of the AI chip market.\nLast year, the company said it had been contacted by watchdogs in the US, UK, European Union, South Korea, and China.\nAdditional reporting by Graham Fraser",
            "source": "bbc_news"
        },
        {
            "title": "Nvidia targeted by China in new chip war probe",
            "content": "China has launched an investigation into US computer chipmaker Nvidia, targeting one of America's leading tech companies over alleged violations of anti-monopoly laws.\nThe probe marks the latest salvo in an ongoing US-China tech war over the lucrative semiconductor market.\nLast week, Washington tightened restrictions on sales of certain exports to Chinese companies and the clash over the industry is expected to continue when Donald Trump re-enters the White House.\nNvidia said it was \"happy to answer any questions regulators may have about our business\".\n\"We work hard to provide the best products we can in every region and honour our commitments everywhere we do business,\" the company said in a statement.\nOn Monday, Chinese state broadcaster CCTV said that authorities in Beijing had launched a probe \"in accordance with the law\".\nIt said Nvidia had been accused of violating commitments made in 2020 when it acquired Mellanox Technologies, a smaller firm.\nIt comes after a fresh crackdown by the US last week, which saw restrictions on sales to 140 companies including Chinese chip firms such as Piotech and SiCarrier without special permission.\nAt the time, China responded with new tough rules restricting sales of key minerals to the US, including antimony, gallium, and germanium.\nAnalysts noted that the move was significant for singling out the US for such restrictions, instead of instituting blanket limits.\nSeveral trade groups representing Chinese firms also spoke out, warning their members against buying from US companies.\nFounded in 1993, Nvidia was originally known for making the type of computer chips that process graphics, particularly for computer games.\nThe tech giant now stands at the forefront of the development of chips that power artificial intelligence (AI), with a market value of more than $3tn.\nIts growing dominance of the industry has caught the attention of competition regulators in the US and elsewhere.\nLast month, Nvidia acknowledged it had been contacted by watchdogs around the world, including in the US, the UK, the European Union, South Korea and China.\nBut the company has also been caught in the middle of rising geopolitical and economic tensions between the US and China, as the two countries race to establish dominance over high-end chips.\nNvidia reported last month that customers based in \"China, including Hong Kong\" had accounted for about 13% of sales so far this year.\nThat is down since the US started ramping up restrictions of advanced technology to Chinese firms just a few years ago, citing national security fears.\nNvidia's chief executive Jensen Huang was tight-lipped earlier this year when asked by business analysts about the political risks for the firm in the months ahead.\n\"We guide one quarter at a time,\" he said. \"Whatever the new administration decides, we'll, of course, support the administration.\"\nJames Lewis, researcher at the Center for Strategic and International Studies, a Washington-based think tank, said the move against Nvidia appeared to be another form of \"retaliation\" by Beijing.\n\"The timing is not a coincidence,\" he said. \"It's mainly a message to the US government - the Chinese have decided they're not just going to take sanction after sanction.\"\nIn prior cases when the US has imposed export controls, it has only delayed not stopped the other country's ability to gain access to the technology, Mr Lewis said, adding that he was skeptical that the AI at the heart of the dispute was as game-changing as the two sides contend.\nRegardless of the reasoning, however, he said he expected the tit-for-tat to continue.\n\"It's really a grudge match on both sides,\" he said.",
            "source": "bbc_news"
        },
        {
            "title": "Nvidia plunges almost 10% as global markets fall",
            "content": "UK shares dropped on Wednesday morning following falls in Asian and US markets as concerns grow about the world's largest economy.\nData showed US manufacturing activity remains subdued, with investors now focussed now on US jobs figures due on Friday.\nAmerican chip giant Nvidia was hit particularly hard, slumping by almost 10% as optimism about the boom in artificial intelligence (AI) dampened.\nDespite the sharp fall, Nvidia's shares are still worth double their value a year ago.\nThe FTSE 100 index, which comprises the largest companies on the London Stock Exchange, dropped 0.55% by lunchtime, with major European indexes also down. Germany's Dax fell 1.41%, France's Cac 40 was down by almost 1%, and Spain's Ibex was also lower, by 0.51%.\nMarket watchers are now trying to second-guess how the Federal Reserve, the US central bank, will respond when it meets to decide interest rate policy next week.\n\"Growth concerns are dominating market moves,\" Julia Lee at FTSE Russell told the BBC.\nIn New York on Tuesday, the S&P 500 index closed more than 2% lower, while the technology-heavy Nasdaq fell by over 3%.\nNasdaq-listed Nvidia fell by 9.5%, wiping $279bn (Â£212.9bn) off its stock market valuation.\nOver the longer term however Nvidia shares are still worth nine times their price in November 2022, when the launch of ChatGPT set off the current bout of interest in AI, prompting a surge in demand for Nvidia's chips.\nOther US tech giants â including Alphabet, Apple and Microsoft â also saw their shares tumble on Tuesday.\nJapan's Nikkei 225 ended Wednesdayâs trading session 4.2% lower, while South Korea's Kospi lost more than 3% and the Hang Seng in Hong Kong dropped 1.1%.\nMajor Asian technology firms including TSMC, Samsung Electronics, SK Hynix and Tokyo Electron were sharply lower.\nAsian markets have performed less strongly over the last year, with the Shanghai and Hong Kong indexes lower over the twelve months. Japan's Nikkei is up 12% over the year, however.\n\"Concerns around global growth look to be hitting exporting countries in the region particularly hard,\" Ms Lee added.\nAs well as next week's interest rate decision in the US, investors will be waiting for Friday's US jobs market report, to provide further signs on the direction the US economy is taking.\nSwetha Ramachandran, fund manager for Artemis Investment Management in London, said Tuesday's US share falls were a sign that investors were beginning to doubt the Federal Reserve would make a large cut in interest rates.\nNvidiaâs slide was a matter of âexpectations catching up with realityâ for the AI giant, she told the BBC.\nâ[Nvidia] did report results last week where it alluded to a natural and expected deceleration in growth: from having delivered 122% growth in the second quarter it expects to deliver 80% growth in the third quarter,â she said.\nThe fall might also be a reaction to reports that the US Department of Justice had issued a subpoena, requiring the firm to give evidence over anti-trust issues, she added.\nHowever, Nvidia later said that it had not been subpoenaed.\nThe Department of Justice declined to comment.",
            "source": "bbc_news"
        }
    ],
    "AP": [
        {
            "title": "President Trump to meet with Nvidia CEO Jensen Huang at the White House",
            "content": "President Donald Trump is meeting Friday with Nvidia CEO Jensen Huang, whose company designs and supplies the advanced computer chips that play an integral role in developing artificial intelligence.\nThe meeting at the White House was confirmed by a person familiar who insisted on anonymity to discuss the conversation between Huang and Trump. The person said the meeting was set up weeks ago and would enable them to get acquainted and talk about AI policy. Nvidia, based in Santa Clara, Calif., declined to comment on the meeting.\nNvidia had loudly protested a last-minute move by the Biden administration in January to expand AI chip restrictions beyond adversaries like China to more than 100 other countries, including Singapore. But it remains to be seen if Trump will follow through with or drop those proposed rules.\nTrump signed an order on his first day in office last week that said his administration would “identify and eliminate loopholes in existing export controls,” signaling that he might continue and harden Biden’s approach.\nThe Republican president is banking on AI to foster economic growth and draw hundreds of billions of dollars in investments, but he also saw the performance of China’s DeepSeek AI technology as a sign that the technology can be developed more cheaply.\nSpeaking Monday to House Republicans in Miami, Trump called the DeepSeek news “positive” if it’s accurate because “you won’t be spending as much and you’ll get the same result.”\n\nTrump said it was a “wake-up call for our industries that we need to be laser-focused on competing to win.”\nDeepSeek has said its recent models were built with Nvidia’s lower-performing H800 chips, which are not banned in China. DeepSeek began attracting more attention in the AI industry last month when it released a new AI model that it boasted was on par with similar models from U.S. companies such as ChatGPT maker OpenAI, and was more cost-effective in its use of expensive Nvidia chips to train the system on troves of data. The chatbot became more widely accessible when it appeared on Apple and Google app stores early this year.\nThe meeting between Trump and Huang comes as leaders of a special House committee focused on countering China have urged Trump’s national security adviser, Michael Waltz, to consider the potential national security benefits of placing export controls on Nvidia semiconductor chips used by DeepSeek. They said the examination should be part of a review that Trump ordered on his first day in office that called on the secretaries of State and Commerce to review the U.S. export control system.\nRep. John Moolenaar, the chairman of the committee, and Rep. Raja Krishnamoorthi, the ranking Democrat on the committee, said DeepSeek made extensive use of a Nvidia chip designed specifically to fall outside U.S. export controls. The lawmakers said that the committee supports American AI innovation, and that support “includes imposing reasonable safeguards” to protect those innovations from China.\n“This demonstrates what the Select Committee has long argued: frequently updating export controls is imperative to ensure (China) will not exploit regulatory gaps and loopholes to advance their AI ambitions,” the two lawmakers wrote in letter dated Wednesday.\nThe pair asked that Waltz look for ways to strengthen controls on shipments through third countries “that pose a high risk of diversion.” Singapore, the letter said, represented 22% of Nvidia’s revenue in its most recently quarterly statement, “despite the company itself revealing most of these shipments ultimately went to users outside of Singapore.”\nCountries such as Singapore, they added, should be subject to strict licensing requirements if they aren’t willing to “crack down” on China using their country as an intermediary for shipments.\nIn an emailed statement, Nvidia said that its revenue associated with Singapore “does not indicate diversion to China.”\n“Our public filings report ‘bill to’ not ‘ship to’ locations of our customers,” a Nvidia spokesperson said. “Many of our customers have business entities in Singapore and use those entities for products destined for the U.S. and the west. We insist that our partners comply with all applicable laws, and if we receive any information to the contrary, act accordingly.”",
            "source": "ap_news"
        },
        {
            "title": "Nvidia rivals focus on building a different kind of chip to power AI products",
            "content": "SANTA CLARA, Calif. (AP) — Building the current crop of artificial intelligence chatbots has relied on specialized computer chips pioneered by Nvidia, which dominates the market and made itself the poster child of the AI boom.\nBut the same qualities that make those graphics processor chips, or GPUs, so effective at creating powerful AI systems from scratch make them less efficient at putting AI products to work.\nThat’s opened up the AI chip industry to rivals who think they can compete with Nvidia in selling so-called AI inference chips that are more attuned to the day-to-day running of AI tools and designed to reduce some of the huge computing costs of generative AI.\n“These companies are seeing opportunity for that kind of specialized hardware,” said Jacob Feldgoise, an analyst at Georgetown University’s Center for Security and Emerging Technology. “The broader the adoption of these models, the more compute will be needed for inference and the more demand there will be for inference chips.”\nIt takes a lot of computing power to make an AI chatbot. It starts with a process called training or pretraining — the “P” in ChatGPT — that involves AI systems “learning” from the patterns of huge troves of data. GPUs are good at doing that work because they can run many calculations at a time on a network of devices in communication with each other.\nHowever, once trained, a generative AI tool still needs chips to do the work — such as when you ask a chatbot to compose a document or generate an image. That’s where inferencing comes in. A trained AI model must take in new information and make inferences from what it already knows to produce a response.\n\nGPUs can do that work, too. But it can be a bit like taking a sledgehammer to crack a nut.\n“With training, you’re doing a lot heavier, a lot more work. With inferencing, that’s a lighter weight,” said Forrester analyst Alvin Nguyen.\nThat’s led startups like Cerebras, Groq and d-Matrix as well as Nvidia’s traditional chipmaking rivals — such as AMD and Intel — to pitch more inference-friendly chips as Nvidia focuses on meeting the huge demand from bigger tech companies for its higher-end hardware.\nD-Matrix, which is launching its first product this week, was founded in 2019 — a bit late to the AI chip game, as CEO Sid Sheth explained during a recent interview at the company’s headquarters in Santa Clara, California, the same Silicon Valley city that’s also home to AMD, Intel and Nvidia.\n“There were already 100-plus companies. So when we went out there, the first reaction we got was ‘you’re too late,’” he said. The pandemic’s arrival six months later didn’t help as the tech industry pivoted to a focus on software to serve remote work.\nNow, however, Sheth sees a big market in AI inferencing, comparing that later stage of machine learning to how human beings apply the knowledge they acquired in school.\n“We spent the first 20 years of our lives going to school, educating ourselves. That’s training, right?” he said. “And then the next 40 years of your life, you kind of go out there and apply that knowledge — and then you get rewarded for being efficient.”\nThe product, called Corsair, consists of two chips with four chiplets each, made by Taiwan Semiconductor Manufacturing Company — the same manufacturer of most of Nvidia’s chips — and packaged together in a way that helps to keep them cool.\nThe chips are designed in Santa Clara, assembled in Taiwan and then tested back in California. Testing is a long process and can take six months — if anything is off, it can be sent back to Taiwan.\nD-Matrix workers were doing final testing on the chips during a recent visit to a laboratory with blue metal desks covered with cables, motherboards and computers, with a cold server room next door.\nWhile tech giants like Amazon, Google, Meta and Microsoft have been gobbling up the supply of costly GPUs in a race to outdo each other in AI development, makers of AI inference chips are aiming for a broader clientele.\nForrester’s Nguyen said that could include Fortune 500 companies that want to make use of new generative AI technology without having to build their own AI infrastructure. Sheth said he expects a strong interest in AI video generation.\n“The dream of AI for a lot of these enterprise companies is you can use your own enterprise data,” Nguyen said. “Buying (AI inference chips) should be cheaper than buying the ultimate GPUs from Nvidia and others. But I think there’s going to be a learning curve in terms of integrating it.”\nFeldgoise said that, unlike training-focused chips, AI inference work prioritizes how fast a person will get a chatbot’s response.\nHe said another whole set of companies is developing AI hardware for inference that can run not just in big data centers but locally on desktop computers, laptops and phones.\nBetter-designed chips could bring down the huge costs of running AI to businesses. That could also affect the environmental and energy costs for everyone else.\nSheth says the big concern right now is, “are we going to burn the planet down in our quest for what people call AGI — human-like intelligence?”\nIt’s still fuzzy when AI might get to the point of artificial general intelligence — predictions range from a few years to decades. But, Sheth notes, only a handful of tech giants are on that quest.\n“But then what about the rest?” he said. “They cannot be put on the same path.”\nThe other set of companies don’t want to use very large AI models — it’s too costly and uses too much energy.\n“I don’t know if people truly, really appreciate that inference is actually really going to be a much bigger opportunity than training. I don’t think they appreciate that. It’s still training that is really grabbing all the headlines,” Sheth said.",
            "source": "ap_news"
        },
        {
            "title": "Stock market today: Wall Street trims its stellar gains as Nvidia’s star dims again",
            "content": "NEW YORK (AP) — U.S. stock indexes pulled back on Tuesday to trim some of their stellar gains for the year.\nThe S&P 500 slipped 0.4%, though it’s still near its all-time high set earlier this month. The Dow Jones Industrial Average dropped 267 points, or 0.6%, and the Nasdaq composite gave back 0.3% from its record set the day before.\nNvidia, the superstar stock that’s been a big reason for Wall Street’s run to repeated records this year, fell 1.2% to weigh on the market. It’s the eighth loss in nine days for the stock, which has dropped more than 12% from its record set last month, as its moonshot momentum slows.\nLike the overall U.S. market, Nvidia’s stock had climbed so much that critics warned expectations had become too high and that the stock price makes sense only if everything goes correctly for it from here.\nAcross a survey of global fund managers, strategists at Bank of America found many plowing into U.S. stocks and pulling out of their cash reserves to do so. The survey found fund managers are holding a notably small percentage of their overall portfolios in cash, similar to 2002 and 2011, which preceded tougher times for riskier investments.\nThe survey’s broadest measure of optimism, based on expectations for economic growth and other indicators, is at its highest level since August 2021, strategist Michael Hartnett said in a BofA Global Research report. That’s a potentially concerning signal for contrarians.\nThe S&P 500 is on track for one of its best years since the millennium, up nearly 27%, because the U.S. economy has remained remarkably resilient, hopes are high that President-elect Donald Trump’s  policies will boost growth but not inflation too badly and the Federal Reserve has begun to make things easier by cutting interest rates from a two-decade high.\n\nThe Fed is widely expected to announce the third cut of the year to its main interest rate on Wednesday, and officials are also scheduled to unveil projections about where they see rates heading in upcoming years.\nExpectations for coming cuts have been on the downswing, though, as inflation  looks like it could stubbornly stick above the Fed’s 2% target after slowing sharply from its peak above 9%.\nA report on Tuesday showed sales at U.S. retailers strengthened by more  last month than economists expected. That could be an indication of an economy that doesn’t need much more help from easier interest rates. While lower rates can goose the economy, they can also give inflation more fuel.\n“The Fed is still on track to cut rates (Wednesday), but more strong economic data could make it more likely they’ll pause in January,” according to Chris Larkin, managing director, trading and investing, at E-Trade from Morgan Stanley.\nIn the bond market, Treasury yields held relatively steady following the report. The 10-year Treasury yield held at 4.40%, where it was late Monday. The two-year yield, which more closely tracks expectations for the Fed, edged down to 4.24% from 4.25%.\nOn Wall Street, Broadcom fell 3.9% for its first loss following two big gains where it had led the market. The tech company’s stock leaped 24.4% and then 11.2% in consecutive days after delivering a profit report and a forecast for upcoming revenue that topped analysts’ expectations, in part because of demand for its artificial-intelligence products.\nBroadcom and Nvidia were the two heaviest weights on the S&P 500 Tuesday.\nPfizer helped limit the market’s loss after rising 4.7%. It gave a forecast for profit next year that was stronger than some analysts’ estimates. Other pharmaceutical stocks were also near the front of the market, including a 3.2% gain for Bristol-Myers Squibb.\nAll told, the S&P 500 slipped 23.47 points to 6,050.61. The Dow Jones Industrial Average dropped 267.58 to 43,449.90, and the Nasdaq composite dipped 64.83 to 20,109.06.\nIn stock markets abroad, London’s FTSE 100 fell 0.8% ahead of an announcement on interest rates by the Bank of England on Thursday.\nJapan’s central bank will also meet on interest rates later this week, and Tokyo’s Nikkei 225 slipped 0.2%. Unlike others around the world, the Bank of Japan is raising rates after keeping its policy rate below zero for years.\nBitcoin set a record above $108,000 before pulling back toward $106,500, according to CoinDesk.com. It’s catapulted from roughly $44,000 at the start of the year, riding a recent wave of enthusiasm that Trump  will create a system that’s more favorable to digital currencies.\nAP Business Writer Elaine Kurtenbach contributed.",
            "source": "ap_news"
        },
        {
            "title": "Stock market today: Nvidia helps pull US indexes higher",
            "content": "NEW YORK (AP) — Nvidia helped pulled U.S. stock indexes higher on Tuesday after they stumbled in the morning on worries about escalations in the Russia-Ukraine war.\nThe S&P 500 rose 0.4% after erasing an early drop of 0.7%. The Nasdaq composite also shook off an early loss to turn 1% higher, while the Dow Jones Industrial Average slipped 120 points, or 0.3%.\nNvidia’s 4.9% climb accounted for the vast majority of the index’s gain. The chip company’s stock rallied ahead of its profit report for the latest quarter, which is coming on Wednesday, and vaulted its gain for the year to nearly 197% thanks to the craze around artificial-intelligence technology.\nActivity in the options market suggests Nvidia’s profit report may be the most anticipated event on Wall Street for the rest of the year, beating out the upcoming jobs report and even the next meeting of the Federal Reserve on interest rates, according to strategists at Barclays Capital.\nIt’s “a testament to the outsized impact of AI, and the apparent resurgence of upside chasing by” smaller-pocketed, everyday investors known as retail traders, according to Barclays’ Stefano Pascale and Anshul Gupta.\nNvidia’s rise helped calm the stock market, even as indexes sank across Europe after Russia said Ukraine fired six U.S.-made ATACMS missiles  at it. Earlier in the day, Russian President Vladimir Putin formally lowered the threshold  for Russia’s use of its nuclear weapons. Both France’s CAC 40 and Germany’s DAX fell 0.7%.\n\nThe worries also sent investors into U.S. Treasury bonds, which are seen as some of the world’s safest investments. The rise in their prices in turn lowered their yields, and the 10-year Treasury yield fell to 4.39% from 4.41% late Monday.\nGold also rose 0.6% and recovered some of the losses it sustained following Donald Trump’s victory  in the U.S. presidential election, as investors herded into places traditionally considered safer during times of trouble.\nEarly in the day, such cautiousness overshadowed optimism coming from reports by big U.S. retailers showing fatter profits for the summer than analysts expected.\nWalmart climbed 3% after topping forecasts for both profit and revenue. The nation’s biggest retailer said it saw broad-based strength across its categories, including sales made both online and in stores. It also said it served more upper-income households, while raising its forecasts for sales and profit for the full year.\nLowe’s likewise delivered bigger profit and revenue for the latest quarter than analysts expected, but its stock nevertheless dropped 4.6%. A report in the morning said construction crews broke ground on fewer new homes last month than economists expected, and rival Home Depot slipped 0.9%.\nOther big companies set to report their latest quarterly results this week include Target on Wednesday and Deere on Thursday.\nElsewhere on Wall Street, Super Micro Computer jumped 31.2% after it filed a plan to keep its stock listed on Nasdaq’s exchange. It hired an independent auditor, BDO USA, which can help it file financial statements needed in order to comply with Nasdaq’s listing requirements.\nThe company’s stock has been on a wild ride. It more than quadrupled in the first two and a half months of this year because the company makes servers used in AI. But it gave up all that and more, with losses accelerating after Ernst & Young resigned as its public accounting firm. A special committee of the company’s board later said that a three-month investigation found “no evidence of fraud or misconduct on the part of management or the Board of Directors.”\nBerry Global Group fell 1.3% after Amcor said it would buy the maker of prescription vials, bags and other products in an all-stock deal. Amcor dropped 2.6%.\nIncyte sank 8.3% after the biopharmaceutical company said it’s pausing enrollment in its ongoing study of a potential treatment for hives in chronic spontaneous urticaria. It also said data from another study evaluating a potential treatment for cholestatic pruritus does not support further development.\nAll told, the S&P 500 rose 23.36 points to 5,916.98. The Dow dropped 120.66 to 43,268.94, and the Nasdaq composite rose 195.66 to 18,987.47.\nIn stock markets abroad, indexes in Asia were more stable than in Europe. They rose 0.7% in Shanghai and 0.4% in Hong Kong, rebounding from early losses.\nAP Business Writers Matt Ott and Elaine Kurtenbach contributed.",
            "source": "ap_news"
        },
        {
            "title": "Stock market today: Wall Street falls sharply as Nvidia tumbles 8.5% and AI mania falters",
            "content": "NEW YORK (AP) — U.S. stock indexes fell sharply Thursday as Wall Street’s frenzy around artificial-intelligence technology faltered some more.\nThe S&P 500 sank 1.6% for its fifth drop in six days after setting an all-time high last week. Concerns about the U.S. economy’s future have been behind much of the drop, including worries about how tariffs pushed by President Donald Trump could worsen inflation, and Wall Street’s main measure of health has lost all but 1.4% of its rally since Election Day.\nThe Dow Jones Industrial Average dropped 193 points, or 0.4%, and the Nasdaq composite tumbled 2.8%.\nWeighing most heavily on the market was superstar stock Nvidia, one of Wall Street’s most influential companies that’s been leading the market for years. After initially rising at the open of trading following a better-than-expected profit report, Nvidia quickly slid to a loss of 8.5%.\nBetter-than-expected earnings reports have become routine for Nvidia, whose chips are powering the surge into artificial-intelligence technology, but this was the company’s first since DeepSeek shook the entire AI industry.\nAP business correspondent Damian Troise reports markets are off to a mixed start.\nAfter the Chinese upstart said it developed a large language model that can compete with the world’s best without using the most expensive chips, Wall Street had to question all the spending it assumed would go into Nvidia’s chips and the ecosystem that’s built around the AI boom, such as electricity to power large data centers.\n\nNvidia’s performance for the latest quarter, along with its forecasts for upcoming results, were “good enough to keep the debate moving in a positive direction,” according to analysts at UBS led by Timothy Arcuri.\nBut it apparently wasn’t enough to send Nvidia’s stock higher, particularly given criticism that its price had already leaped too high, too quickly. After more than tripling two years ago, Nvidia’s stock more than doubled last year as its sales exploded.\nThe market also soured on Salesforce, which fell 4% despite topping analysts’ profit expectations for the latest quarter. Several analysts called the performance solid, and the company continued to tout its AI offerings, but it gave a forecast for upcoming revenue that fell short of expectations.\nOne AI-related company bucking the trend was Snowflake. The AI data cloud company rose 4.5% after delivering stronger profit and revenue for the latest quarter than analysts expected.\nIt joined a range of stocks on the more staid end of Wall Street, ones that didn’t grab as many headlines as AI stocks in recent years. Despite the sharp loss for the overall S&P 500, close to 2 out of every 5 stocks in the index climbed.\nA 1.7% rise for Berkshire Hathaway, the company run by famed investor Warren Buffett, was one of the strongest upward forces on the index. The owner of Geico, BNSF railroad and other businesses has built a hoard of unused cash recently. That could indicate Buffett, who’s famous for buying stocks when prices are low, may not see much worth purchasing in a market that critics say looks too expensive.\nSome investors have been waiting for other stocks to pick up the market’s leadership baton from Nvidia and the handful of big stocks that dominated for years. Nvidia alone accounted for a little more than 22% of the entire total return for the S&P 500 index last year.\nAll told, the S&P 500 fell 94.49 points to 5,861.57 Thursday. The Dow Jones Industrial Average dropped 193.62 to 43,239.50, and the Nasdaq composite tumbled 530.84 to 18,544.42.\nIn the bond market, Treasury yields swung following Trump’s latest announcement on tariffs. He said “the proposed TARIFFS scheduled to go into effect on MARCH FOURTH will, indeed, go into effect, as scheduled” for imports from Canada and Mexico. He also said he would add an additional 10% tariff on Chinese products on that date.\nSuch moves could push up prices for U.S. households when inflation has already proven to be stubborn. Wall Street has been hoping the threats are merely leverage that Trump will use to negotiate with other countries before ultimately inflicting less pain on the economy than feared.\nBut even if that proves to be the case, all the talk on tariffs has already gotten U.S. households to feel more nervous about the economy. That’s dangerous because their strong spending has been a main reason the U.S. economy has avoided a recession.\nSuch uncertainty also pressures the Federal Reserve, which has few if any tools to help an economy where growth is slowing and inflation is rising at the same time.\nJeff Schmid, president of the Federal Reserve Bank of Kansas City, said in a speech Thursday that he has “become more cautious” in his hopes that inflation will continue to ease. He also said that discussions with people in his district suggest “elevated uncertainty might weigh on growth” for the economy.\nFor now, at least, the U.S. economy appears to be in solid shape. The government on Thursday left alone its estimate for the U.S. economy’s performance during the last three months of 2024, though it raised its estimate for a measure of inflation during the quarter.\nA separate report said more U.S. workers applied for unemployment benefits last week. While the number is at a three-month high, it’s still nowhere close to where it’s been in past recessions.\nIn the bond market, the yield on the 10-year Treasury edged up to 4.27% from 4.26% late Wednesday.\nIn stock markets abroad, indexes were mixed across Europe and Asia. Germany’s DAX lost 1.1%, while Japan’s Nikkei 225 added 0.3%.\nAP Business Writers Matt Ott and Elaine Kurtenbach contributed.",
            "source": "ap_news"
        },
        {
            "title": "Stock market today: Wall Street rises with Nvidia as bitcoin bursts above $99,000",
            "content": "NEW YORK (AP) — U.S. stocks climbed Thursday after market superstar Nvidia  and another round of companies said they’re making even fatter profits than expected.\nThe S&P 500 pulled 0.5% higher after flipping between gains and losses several times during the day. Banks, smaller companies and other areas of the stock market that tend to do best when the economy is strong helped lead the way, while bitcoin briefly broke above $99,000. Crude oil, meanwhile, continued to rise.\nThe Dow Jones Industrial Average jumped 461 points, or 1.1%, and the Nasdaq composite edged up by less than 0.1%.\nNvidia rose just 0.5% after beating analysts’ estimates  for profit and revenue yet again, but it was still the strongest force pulling the S&P 500 upward. It also gave a forecast for revenue in the current quarter that topped most analysts’ expectations due to voracious demand for its chips used in artificial-intelligence technology.\nIts stock initially sank in afterhours trading Wednesday following the release of the results. Some investors said the market might have been looking for Nvidia’s revenue forecast to surpass expectations by even more. But its stock recovered in premarket trading Thursday, and Wedbush analyst Dan Ives said it was another “flawless” profit report provided by Nvidia and CEO Jensen Huang, whom Ives calls “the Godfather of AI.”\nThe stock meandered through Thursday as well, dragging the S&P 500 and other indexes back and forth. How Nvidia’s stock performs has more impact  than any other because it’s grown into Wall Street’s most valuable company at roughly $3.6 trillion.\n\nThe frenzy around AI is sweeping up other stocks, and Snowflake jumped 32.7% after reporting stronger results for the latest quarter than analysts expected. The company, whose platform helps customers get a better view of all their silos of data and use AI, also reported stronger revenue growth than expected.\nBJ’S Wholesale Club rose 8.3% after likewise delivering a bigger profit than expected. That may help calm worries about how resilient U.S. shoppers can remain, given high prices across the economy and still-high interest rates.\nA day earlier, Target tumbled  after reporting sluggish sales in the latest quarter and giving a dour forecast for the holiday shopping season. It followed Walmart, which gave a much more encouraging outlook.\nNearly 90% of the stocks in the S&P 500 ended up rising Thursday, and the gains were even bigger among smaller companies. The Russell 2000 index of smaller stocks jumped a market-leading 1.7%.\nGoogle’s parent company, Alphabet, helped keep indexes in check. It fell 4.7% after U.S. regulators asked a judge to break up the tech giant by forcing it to sell its industry-leading Chrome web browser.\nIn a 23-page document filed late Wednesday, the U.S. Department of Justice called for sweeping punishments that would include restrictions preventing Android from favoring its own search engine. Regulators stopped short of demanding Google sell Android but left the door open to it if the company’s oversight committee continues to see evidence of misconduct.\nAll told, the S&P 500 rose 31.60 points to 5,948.71. The Dow jumped 461.88 to 43,870.35, and the Nasdaq composite added 6.28 to 18,972.42.\nIn the crypto market, bitcoin eclipsed $99,000 for the first time before pulling back toward $98,000, according to CoinDesk. It’s more than doubled so far this year, and its climb has accelerated since Election Day. President-elect Donald Trump has pledged to make the country “the crypto capital  of the planet” and create a “strategic reserve” of bitcoin.\nBitcoin got a further boost after Gary Gensler, the chair of the Securities and Exchange Commission, said Thursday he would step down in January. Gensler has pushed for more protections for crypto investors.\nBitcoin and related investment have a notorious history of big price swings in both directions. MicroStrategy, a company that’s been raising cash expressly to buy bitcoin, saw an early Thursday gain of 14.6% for its stock quickly disappear. It finished the day with a loss of 16.2%.\nIn the oil market, a barrel of benchmark U.S. crude rose 2% to bring its gain for the week to 4.8%. Brent crude, the international standard, climbed 1.8%. Oil has been rising amid escalations in the Russia-Ukraine  war.\nIn stock markets abroad, shares of India’s Adani Enterprises plunged 22.6% Thursday after the U.S. charged founder Gautam Adani in a  federal indictment with securities fraud and conspiracy to commit securities and wire fraud. The businessman and one of the world’s richest people is accused of concealing that his company’s huge solar energy project on the subcontinent was being facilitated by an alleged bribery scheme.\nStock indexes elsewhere in Asia and Europe were mixed.\nIn the bond market, the yield on the 10-year Treasury inched up to 4.43% from 4.41% late Wednesday following some mixed reports on the U.S. economy.\nOne said fewer U.S. workers applied for unemployment benefits  last week in the latest signal that the job market remains solid. Another report, though, said manufacturing in the mid-Atlantic region unexpectedly shrank. Sales of previously occupied homes, meanwhile, strengthened last month by more  than expected.\nAP Business Writers Matt Ott and Yuri Kageyama contributed.",
            "source": "ap_news"
        },
        {
            "title": "Nvidia faces a reckoning as Chinese upstart raises questions about Wall Street’s darling",
            "content": "NEW YORK (AP) — The superstar run for Nvidia’s stock the last few years has been astonishing. So was its tumble Monday, which caused $595 billion in wealth to vanish. That’s about as much as PepsiCo, McDonalds, Starbucks and Target are worth, combined.\nMostly known only in gaming and crypto circles a few years ago, Nvidia burst into the zeitgeist after seeing its sales surge because customers wanted its chips to train their chatbots and other artificial intelligence products.\nNvidia became a household name as its stock more than tripled in 2023 and then more than doubled in 2024. Investors and analysts lauded CEO Jensen Huang as the “Godfather of AI.” Nvidia grew into a $3 trillion-plus behemoth and traded places with titans like Apple to become the most valuable company on Wall Street.\nBut that all came to a screeching halt Monday, at least for a moment, after a Chinese upstart called DeepSeek said it had developed a large-language model that could perform like ChatGPT and other U.S. rivals, but by using far less computing power.\nHere’s a look at how it all got to this point:\nNvidia’s roots began in gaming.\nThe Santa Clara, California-based tech company’s invention of the graphics processor unit, or GPU, in 1999 helped spark the growth of the PC gaming market and redefined computer graphics. Now Nvidia’s specialized chips are key components that help power different forms of artificial intelligence, including the latest generative AI chatbots such as ChatGPT and Google’s Gemini.\n\nHuang has dubbed AI “the next industrial revolution,” and Nvidia’s GPUs are designed to perform artificial intelligence tasks faster and more efficiently than general-purpose chips like CPUs. Tech giants are snapping up Nvidia chips as they wade deeper into AI — a movement that’s enabling cars to drive by themselves, and generating stories, art and music.\nThe demand helped Nvidia’s revenue grow by eye-popping levels, quarter after quarter. On Feb. 23, 2023, after Nvidia breezed past analysts’ expectations for quarterly profit, Huang said that “AI is at an inflection point, setting up for broad adoption reaching into every industry.” The company’s quarterly revenue at the time was $6.05 billion.\nThat ramped up to $7.19 billion just three months later and then nearly doubled to $13.51 billion three months after that. Revenue has since vaulted to $35.08 billion in the three months through October 2024.\nThe company’s stock price has similarly soared, and its total market value quickly passed rivals like Intel, Microsoft and others. Nvidia alone accounted for more than a fifth of all of the S&P 500 index’s total return last year. No other stock came close, and it had more than triple Apple’s impact.\nBuy an S&P 500 index fund today, and nearly 6 cents out of every $1 will go only into Nvidia. That leaves 94 cents for all the other 499 companies.\nUnlike the dot-com boom, real money was behind Nvidia’s surge, and its stock price rose on expectations of ever more to come. Those expectations came into question on Monday.\nDeepSeek and its seemingly lower-cost operations raised worries about whether companies would need to spend as many dollars on Nvidia chips as previously thought. The concerns dragged down stocks across the AI industry, including suppliers to the chip industry and the power companies hoping to electrify the vast data centers that were expected to get built to run those chips. But Nvidia was in the spotlight because its stock has become the brightest symbol of the AI bonanza.\nSome on Wall Street saw Monday’s nearly 17% plunge for Nvidia’s stock as an opportunity rather than a signal of pending doom, saying the stock became more affordable. If AI does become cheaper to run, it could open the door to new kinds of customers and software innovations that could ultimately help the industry in the long term.\n“As for Nvidia itself, this isn’t the first time a major tech stock has faced existential questions,” said John Belton, portfolio manager at Gabelli Funds. “We’ve seen similar situations with Microsoft, Apple, Meta, Google, Amazon, and Netflix — companies that were once doubted but ultimately rebounded.”\nDeepSeek’s entrance certainly adds uncertainty to the entire AI ecosystem, but it doesn’t change the overwhelming momentum behind the movement, according to Brian Colello, strategist at Morningstar.\n“We believe that AI GPU demand still exceeds supply,” he wrote in a report. “So, while slimmer models may enable greater development for the same number of chips, we still think tech firms will continue to buy all the GPUs they can as part of this AI ‘gold rush.’”\nFor its part, Nvidia’s stock wobbled between gains and losses early Tuesday following its worst plunge since the 2020 COVID crash, and then rallied a bit and ended the day nearly 9% higher.",
            "source": "ap_news"
        }
    ]
}